In [17]:
import pandas as pd

### EURCHF

In [18]:
df = pd.read_excel('data/snb-data-devkum-de-selection-20170802_1430.xlsx', sheet='data')

In [19]:
# Add -15 because they are monthly averages
df['date'] = df['date'] + "-15"

In [20]:
df.head()

         date   value
0  2010-01-15  1.4767
1  2010-02-15  1.4673
2  2010-03-15  1.4484
3  2010-04-15  1.4339
4  2010-05-15  1.4199

In [21]:
# Only take data starting from 2013 (need to convert first)
df['date'] = pd.to_datetime(df['date'], format='%Y-%m-%d')
df = df.set_index('date')
df = df['2013':].reset_index()

In [22]:
# Convert back to text
df['date'] = df['date'].apply(lambda x: x.strftime('%Y-%m-%d'))

In [23]:
# Export to csv
df.to_csv('web/EURCHF.csv', index=False)

In [24]:
# Check
df.head()

         date   value
0  2013-01-15  1.2280
1  2013-02-15  1.2298
2  2013-03-15  1.2264
3  2013-04-15  1.2198
4  2013-05-15  1.2406

## GDP

In [46]:
df = pd.read_excel('data/bip.xls', sheet='data')

In [47]:
df.head()

        date      value
0 2010-02-15  91.611406
1 2010-05-15  92.407963
2 2010-08-15  92.806647
3 2010-11-15  93.565148
4 2011-02-15  93.821060

In [48]:
# Only take data starting from 2013 (need to convert first)
df['date'] = pd.to_datetime(df['date'], format='%Y-%m-%d')
df = df.set_index('date')
df = df['2013':].reset_index()

In [49]:
# Convert back to text
df['date'] = df['date'].apply(lambda x: x.strftime('%Y-%m-%d'))

In [50]:
# Export to csv
df.to_csv('web/GDP.csv', index=False)

In [51]:
df.head()

         date      value
0  2013-02-15  96.177475
1  2013-05-15  97.099430
2  2013-08-15  97.417133
3  2013-11-15  97.776827
4  2014-02-15  98.321124

In [52]:
df

          date       value
0   2013-02-15   96.177475
1   2013-05-15   97.099430
2   2013-08-15   97.417133
3   2013-11-15   97.776827
4   2014-02-15   98.321124
5   2014-05-15   98.647684
6   2014-08-15   99.241118
7   2014-11-15  100.000000
8   2015-02-15   99.486811
9   2015-05-15   99.563137
10  2015-08-15   99.871977
11  2015-11-15  100.400424
12  2016-02-15  100.693624
13  2016-05-15  101.179395
14  2016-08-15  101.210639
15  2016-11-15  101.375051
16  2017-02-15  101.646875

## Jobless

In [70]:
df = pd.read_excel('data/alq.xlsx', sheet='data')

In [71]:
df.head()

        date  value
0 2010-01-31    NaN
1 2010-02-28    NaN
2 2010-03-31    NaN
3 2010-04-30    NaN
4 2010-05-31    NaN

In [72]:
# Only take data starting from 2013 (need to convert first)
df['date'] = pd.to_datetime(df['date'], format='%Y-%m-%d')
df = df.set_index('date')
df = df['2013':].reset_index()

In [73]:
# Convert back to text
df['date'] = df['date'].apply(lambda x: x.strftime('%Y-%m-%d'))

In [74]:
# Export to csv
df.to_csv('web/ALQ.csv', index=False)

In [75]:
df.head()

         date     value
0  2013-01-31  2.933333
1  2013-02-28  2.958333
2  2013-03-31  2.983333
3  2013-04-30  3.008333
4  2013-05-31  3.033333

## SNB Balance

In [77]:
df = pd.read_excel('data/snb-data-snbbipo-de-selection-20170731_1611.xlsx', sheet='data')

In [78]:
# Add -15 because they are monthly averages
df['date'] = df['date'] + "-15"

In [80]:
# Make billions
df['value'] = df['value'] / 1000

In [81]:
df.head()

         date       value
0  2010-01-15  195.312590
1  2010-02-15  195.565227
2  2010-03-15  208.904086
3  2010-04-15  227.301166
4  2010-05-15  308.575420

In [82]:
# Only take data starting from 2013 (need to convert first)
df['date'] = pd.to_datetime(df['date'], format='%Y-%m-%d')
df = df.set_index('date')
df = df['2013':].reset_index()

In [83]:
# Convert back to text
df['date'] = df['date'].apply(lambda x: x.strftime('%Y-%m-%d'))

In [84]:
# Export to csv
df.to_csv('web/SNB.csv', index=False)

In [85]:
# Check
df.head()

         date       value
0  2013-01-15  502.690391
1  2013-02-15  504.229482
2  2013-03-15  511.720556
3  2013-04-15  504.877900
4  2013-05-15  507.143778

In [86]:
df.value.describe()

count     54.000000
mean     596.117246
std       97.040902
min      488.867596
25%      504.391586
50%      575.159580
75%      673.699112
max      782.862516
Name: value, dtype: float64

## Inflation

In [92]:
df = pd.read_excel('data/Inflation.xlsx', sheet='data')

In [93]:
# Only take data starting from 2013
df = df.set_index('date')
df = df['2013':].reset_index()

In [95]:
# Convert back to text
df['date'] = df['date'].apply(lambda x: x.strftime('%Y-%m'))

In [96]:
# Add -15 because they are monthly averages
df['date'] = df['date'] + "-15"

In [97]:
df.head()

         date  value
0  2013-01-15   -0.3
1  2013-02-15   -0.3
2  2013-03-15   -0.6
3  2013-04-15   -0.6
4  2013-05-15   -0.5

In [98]:
# Export to csv
df.to_csv('web/Inflation.csv', index=False)

In [85]:
# Check
df.head()

         date       value
0  2013-01-15  502.690391
1  2013-02-15  504.229482
2  2013-03-15  511.720556
3  2013-04-15  504.877900
4  2013-05-15  507.143778

In [99]:
df.value.describe()

count    55.000000
mean     -0.341818
std       0.557671
min      -1.400000
25%      -0.700000
50%      -0.200000
75%       0.000000
max       0.600000
Name: value, dtype: float64

In [100]:
df.tail()

          date  value
50  2017-03-15    0.6
51  2017-04-15    0.4
52  2017-05-15    0.5
53  2017-06-15    0.2
54  2017-07-15    0.3

In [101]:
df

          date  value
0   2013-01-15   -0.3
1   2013-02-15   -0.3
2   2013-03-15   -0.6
3   2013-04-15   -0.6
4   2013-05-15   -0.5
5   2013-06-15   -0.1
6   2013-07-15    0.0
7   2013-08-15    0.0
8   2013-09-15   -0.1
9   2013-10-15   -0.3
10  2013-11-15    0.1
11  2013-12-15    0.1
12  2014-01-15    0.1
13  2014-02-15   -0.1
14  2014-03-15    0.0
15  2014-04-15    0.0
16  2014-05-15    0.2
17  2014-06-15    0.0
18  2014-07-15    0.0
19  2014-08-15    0.1
20  2014-09-15   -0.1
21  2014-10-15    0.0
22  2014-11-15   -0.1
23  2014-12-15   -0.3
24  2015-01-15   -0.5
25  2015-02-15   -0.8
26  2015-03-15   -0.9
27  2015-04-15   -1.1
28  2015-05-15   -1.2
29  2015-06-15   -1.0
30  2015-07-15   -1.3
31  2015-08-15   -1.4
32  2015-09-15   -1.4
33  2015-10-15   -1.4
34  2015-11-15   -1.4
35  2015-12-15   -1.3
36  2016-01-15   -1.3
37  2016-02-15   -0.8
38  2016-03-15   -0.9
39  2016-04-15   -0.4
40  2016-05-15   -0.4
41  2016-06-15   -0.4
42  2016-07-15   -0.2
43  2016-08-15   -0.1
44  2016-09-15   -0.2
45  2016-10-15   -0.2
46  2016-11-15   -0.3
47  2016-12-15    0.0
48  2017-01-15    0.3
49  2017-02-15    0.6
50  2017-03-15    0.6
51  2017-04-15    0.4
52  2017-05-15    0.5
53  2017-06-15    0.2
54  2017-07-15    0.3